; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob11) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - pallet
	crate0 crate1 crate2 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate2)
	(at pallet6 depot1)
	(clear pallet6)
	(at truck0 distributor2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 334)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 344)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 71)
	(at crate1 depot0)
	(on crate1 crate0)
	(= (weight crate1) 9)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(= (weight crate2) 45)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate1 pallet0)
		(on crate2 pallet6)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 2
2. (lift hoist7 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist7) (on crate1 crate0)
   added: (lifting hoist7 crate1) (clear crate0)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 2
3. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   changed: (current_load truck0) from 0 to 45
   goals met: 0 of 2
4. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 2
5. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 2
6. (unload hoist1 crate2 truck0 depot1)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 45 to 0
   goals met: 0 of 2
7. (drop hoist7 crate1 pallet0 depot0)
   deleted: (lifting hoist7 crate1) (clear pallet0)
   added: (available hoist7) (at crate1 depot0) (clear crate1) (on crate1 pallet0)
   goals met: 1 of 2
8. (drop hoist1 crate2 pallet6 depot1)
   deleted: (lifting hoist1 crate2) (clear pallet6)
   added: (available hoist1) (at crate2 depot1) (clear crate2) (on crate2 pallet6)
   goals met: 2 of 2
